ASC_Bugfixes/Catalogs/ТаблицыADO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТаблицыADO</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннееПредставление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеТаблицы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеТекущейТаблицы</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСвязаннойТаблицы</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязаннаяТаблица</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ТаблицыADO</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ASC_Bugfixes/Catalogs/ТаблицыADO/Ext/ObjectModule.bsl
&Вместо("ЗаполнитьРеквизитыОбъекта")
Процедура АСЦ_ЗаполнитьРеквизитыОбъекта() Экспорт
	
	Если Не ПроверитьНаименование() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаПодключение=УправлениеСоединениямиВИБУХ.ПолучитьСтрокуСоединенияADO(Владелец.ВИБПоУмолчанию,,ИмяФайла);
	
	ПоляТаблицы = УправлениеСоединениямиВИБУХ.ВернутьКолонкиТаблицы(Наименование,СтрокаПодключение, Ложь);
	
	Реквизиты.Очистить();
	
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		
		РеквизитТаблицы = Реквизиты.Добавить();
		РеквизитТаблицы.Имя = ПолеТаблицы.Имя;
		РеквизитТаблицы.ВнутреннееПредставление   = ПолеТаблицы.ВнутреннееПредставление; //+++Хижинков А.В. 8.11.2017 добавил строку РеквизитТаблицы.ВнутреннееПредставление   = ПолеТаблицы.ВнутреннееПредставление;
		РеквизитТаблицы.ТипЗначения = ПолеТаблицы.ОписаниеТипов;
		
	КонецЦикла;
	
	ТекТаблицаСвязей = УправлениеСоединениямиВИБУХ.ВернутьТаблицуСвязей(Наименование,СтрокаПодключение);
	СвязанныеТаблицы.Очистить();
	
	Для Каждого СвязаннаяТаблица Из ТекТаблицаСвязей Цикл
		
		ТекущаяТаблица = Справочники.ТаблицыADO.НайтиПоНаименованию(СвязаннаяТаблица.СвязаннаяТаблица, ,Владелец);
		Если ЗначениеЗаполнено(ТекущаяТаблица) Тогда
			НоваяСвязь = СвязанныеТаблицы.Добавить();
			НоваяСвязь.СвязаннаяТаблица = ТекущаяТаблица.Ссылка;
			НоваяСвязь.ПолеТекущейТаблицы = СвязаннаяТаблица.КолонкаТекущейТаблицы;
			НоваяСвязь.ПолеСвязаннойТаблицы = СвязаннаяТаблица.КолонкаСвязаннойТаблицы;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
